import React from 'react'

function Maqolalar() {
    const maqolalar = [
        {
            desc: "Физико-химические свойства фосфогипса и перспективы его использования в производстве строительных материалов",
            id: 1
        },
        {
            desc: "Проблема качественного обучения кадров к беспрепятственной эвакуации людей из высотных зданий и пути её решения с использованием строительных материалов",
            id: 2
        },
        {
            desc: "Обеспечение объективной оценки эффективности инноваций в строительстве",
            id: 3
        },
        {
            desc: "Поликарбоксилатлар сулфатлар ва бошқа модификаторлар асосидаги комплекс кимёвий қўшимчалар",
            id: 4
        },
        {
            desc: "Замонавий қурилиш материалларидан фойдаланиб пол девор ва девор бўшлиқларидан иссиқлик йўқотилишини олдини олиш",
            id: 5
        },
        {
            desc: "Саноат корхоналарининг ривожланиши ва улардан чиқаётган чиқиндилар саноат чиқиндиларидан қурилиш материалларини ишлаб чиқаришда фойдаланиш",
            id: 6
        },
        {
            desc: "Шиша композитли арматураларни бетон билан тишлашиш холатларини ўрганиш",
            id: 7
        },
        {
            desc: "Энергия самарадор уй-жой бинолари қурилишида иссиқлик химояловчи материалларнинг қўлланилиши",
            id: 8
        },
    ]
    return (
        <div className='w-full h-screen'>
            <div className='w-full min-h-screen flex flex-col gap-y-5'>
                {
                    maqolalar.map((item, index) => (
                        <div className='w-7/12 flex items-start gap-x-7 bg-slate-50 rounded-lg p-5' key={item.id}>
                            <p className='font-bold'>{index + 1}</p>
                            <p className='poppins-regular text-xl'>{item.desc}</p>
                        </div>
                    ))
                }

            </div>

        </div>
    )
}

export default Maqolalar